app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all.reverse_order
---
SELECT "tweets".* FROM "tweets" ORDER BY "tweets"."id" DESC

  def create
    @tweet_new = Tweet.new(tweets_params)
    @tweet_new.user_id = current_user.id
    if @tweet_new.save
---
INSERT INTO "tweets" ("content") VALUES ($1) RETURNING "id"  [["content", "hello"]]

  def update
    if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "content" = ? WHERE "tweets"."id" = ?  [["content", "iiiiiii"], ["id", 7]]

  def destroy
    @tweet.destroy
---
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 2]]